
/**
 * 俯瞰相机的最佳起始位置
 */
 export const initPosition = {
  x: -19.029467803079836,
  y: 15.08575775846176,
  z: -8.453932312930382,
};

/**
 * 休闲区视角相机位置
 */
export const XXPosition = {
  x: -11.837694806354726,
  y: 10.752180327822394,
  z: -11.186589082985298,
};

/**
 * 休闲区视角相机看向艺术楼位置
 */
export const XXLookAt = { x: -3.78158, y: -0.05068, z: -3.17348 };

/**
 * 天健区视角相机位置
 */
export const TJPosition = {
  x: 0.5014641287246727,
  y: 9.713808691194616,
  z: -5.529706515722577,
};

/**
 * 天健区视角相机看向图书馆位置
 */
export const TJLookAt = { x: 0.93289, y: 0.53234, z: 1.72216 };


/**
 * 医学院视角相机位置
 */
export const YXYPosition = {
  x: 0.5014641287246727,
  y: 9.713808691194616,
  z: -5.529706515722577,
};
/**
 * 医学院视角相机看向白求恩广场位置
 */
export const YXYLookAt = { x: 11.68362, y: -0.33962, z: 4.13358 };
